In [1]:
!pip show pandas_profiling

Name: pandas-profiling
Version: 3.6.6
Summary: Deprecated 'pandas-profiling' package, use 'ydata-profiling' instead
Home-page: https://github.com/ydataai/pandas-profiling
Author: YData Labs Inc
Author-email: opensource@ydata.ai
License: MIT
Location: /home/shayan/.local/lib/python3.10/site-packages
Requires: ydata-profiling
Required-by:

In [2]:
!pip show ydata_profiling

Name: ydata-profiling
Version: 4.4.0
Summary: Generate profile report for pandas DataFrame
Home-page: https://github.com/ydataai/ydata-profiling
Author: YData Labs Inc
Author-email: opensource@ydata.ai
License: MIT
Location: /home/shayan/.local/lib/python3.10/site-packages
Requires: dacite, htmlmin, imagehash, jinja2, matplotlib, multimethod, numpy, pandas, phik, pydantic, PyYAML, requests, scipy, seaborn, statsmodels, tqdm, typeguard, visions, wordcloud
Required-by: pandas-profiling

In [4]:
from sklearn.datasets import load_diabetes
import pandas as pd
from pandas_profiling import ProfileReport
from ydata_profiling import ProfileReport as y_profile_report
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
# Load the Diabetes dataset
diabetes = load_diabetes()

In [6]:
# Convert the dataset into a pandas DataFrame
df = pd.DataFrame(data=diabetes.data, columns=diabetes.feature_names)

In [7]:
df.sample(3)

          age       sex       bmi  ...        s4        s5        s6
174  0.016281  0.050680  0.009961  ... -0.039493  0.017036  0.007207
223 -0.099961 -0.044642 -0.023451  ... -0.039493 -0.018114 -0.050783
222 -0.023677  0.050680 -0.025607  ... -0.039493  0.001148  0.019633

[3 rows x 10 columns]

In [9]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [15]:
data = sns.load_dataset("titanic")

In [16]:
data.sample(3)

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
273         0       1    male  37.0  ...     C    Cherbourg     no  False
111         0       3  female  14.5  ...   NaN    Cherbourg     no  False
548         0       3    male  33.0  ...   NaN  Southampton     no  False

[3 rows x 15 columns]

In [18]:
# Add the target variable 'Survived' based on 'alive' column
data['Survived'] = data['alive'].apply(lambda x: 1 if x == 'yes' else 0)
data.drop("alive",axis=1,inplace=True)

In [19]:
data.sample(3)

     survived  pclass     sex   age  ...  deck  embark_town  alone Survived
610         0       3  female  39.0  ...   NaN  Southampton  False        0
386         0       3    male   1.0  ...   NaN  Southampton  False        0
321         0       3    male  27.0  ...   NaN  Southampton   True        0

[3 rows x 15 columns]

In [22]:
from pandas_profiling import profile_report

In [25]:
test_1 = data.profile_report()

In [26]:
test_1

Summarize dataset:  93%|█████████▎| 38/41 [00:11<00:01,  2.17it/s, Detecting duplicates]

In [ ]:
# Generate a profile report
profile = ProfileReport(df, title='YData Profiling Report', explorative=True)

# Save the report to a file (optional)
profile.to_file("report.html")

# Display the report in a Jupyter Notebook (optional)
profile.to_notebook_iframe()